<template>
    <div class="privacy-policy-container">
        <main>
            <section>
                <h1>隱私權政策</h1>
                <p>
                    GYM力
                    非常重視各位會員的隱私權，對於會員資料的蒐集、處理及利用均遵守中華民國政府之「個人資料保護法」及相關法令規範。請您於提供個人資料前閱讀以下相關隱私權保護政策的內容。當您使用本平台服務、註冊帳戶、或購買商品時，即表示您已閱讀、瞭解並同意接受本使用條款之所有內容，並特此同意
                    GYM力蒐集、使用、處理個人資料。
                </p>

                <h2>使用 Google 社群登入隱私權政策</h2>

                <h3>登入資訊</h3>
                <p>
                    當您使用 Google 社群登入我們的服務時，我們將獲取您在 Google
                    上公開的基本資料，如您的姓名、電子郵件地址和個人頭像。我們僅會收集您在 Google
                    上設定為公開的資訊。
                </p>

                <h3>資訊使用</h3>
                <p>我們收集的 Google 登入資訊將用於以下目的：</p>
                <ul>
                    <li>用於註冊和驗證您的身份</li>
                    <li>提供和改善我們的服務</li>
                    <li>與您進行溝通，例如向您發送通知和更新</li>
                </ul>

                <h3>資訊分享</h3>
                <p>
                    我們不會在未經您同意的情況下將您的 Google
                    登入資訊分享給第三方。我們僅會在必要時與合作夥伴共享資訊，以提供和改善我們的服務，或者在法律要求下進行。
                </p>

                <h2>隱私政策的適用範圍</h2>
                <p>
                    本隱私政策僅適用於我們的服務。當您選擇使用 Google 社群登入我們的服務時，您同意遵守 Google
                    的服務條款和隱私政策。請仔細閱讀 Google 的相關政策，以了解其對您個人資訊的收集和使用方式。
                </p>

                <h2>個人資料的定義</h2>
                <p>
                    個人資料是指得以識別您的身分且未公開的資料，如：姓名、地址、電話號碼或電子郵件地址。本隱私權保護政策只適用於
                    GYM 力，不適用於非GYM力僱用或管理之人。
                </p>

                <h2>個人資料蒐集種類</h2>
                <p>
                    在您註冊GYM力帳號、使用GYM力 平台或服務、於平台上購買商品、使用GYM力
                    應用程式、填寫問卷、參與任何形式的訪談、以電話或電子郵件聯繫客服、參加贈獎及抽獎活動、於社群媒體平台與
                    GYM 力互動、或是基於任何原因自行提供個人資料時，GYM力 會蒐集您的個人資料。 當您在GYM力
                    註冊時，我們會詢問您的姓名、電子郵件地址、出生年月日、性別等資料。在您使用某些特定服務時，我們可能還會詢問您的聯絡地址、信用卡資料、聯絡電話等相關資料。<br>在您註冊GYM力
                    帳號並登入我們的服務後，我們就能辨別您的身分。 若您使用您的社群媒體帳戶在GYM力
                    註冊，或將您的GYM力帳戶與社群媒體帳戶連結，或使用任何GYM力
                    的社群功能，我們可能會存取您在該社群媒體帳戶提供者之政策下所自願提供予該社群媒體帳戶提供者的資訊，我們將持續依照本隱私權政策來管理及使用相關個人資料。<br>
                    如同大多數網站及行動應用程式，GYM力 也會自動接收並記錄您的 IP
                    位址，以及您用來使用本本平台的裝置相關資訊或該裝置所傳送出的資訊，通常會包含作業系統、瀏覽器類型、行動裝置種類、參考網站的地址、您與
                    GYM力 平台或行動應用程式的互動行為。 此外，也會使用瀏覽器的 Cookie
                    協助本平台紀錄您前次的造訪資訊，當您再次登入時，這項資訊會與您的個人帳戶建立關聯，該資訊也會納入匿名的統計資料中，以協助我們瞭解訪客使用GYM力
                    平台的情形。若您要拒絕 Cookie 的使用，請選擇瀏覽器上的適當設定。
                </p>

                <h2>個人資料使用方式</h2>
                <p>
                    GYM 力
                    僅會基於下述狀況蒐集、處理及利用個人資料，包含會員管理與服務、資訊通訊服務、網路購物、廣告、商業行為以及其他契約、類似契約或法律關係管理之事務或業務等特定目的。
                </p>
                <ul>
                    <li>回應、處理、滿足您對商品交易、配送或其他服務的需求</li>
                    <li>基於客戶關係管理，透過電話、文字簡訊、電子郵件或其他方式與您聯繫</li>
                    <li>
                        進行資料分析、問卷調查、產品開發等相關研究，以瞭解您在 GYM 力
                        平台的使用情形，藉此提升客戶體驗
                    </li>
                    <li>基於行銷或廣告目的，以各種模式向您發送GYM力平台上相關商品、服務、優惠等資訊</li>
                </ul>

                <h2>資料分享與揭露</h2>
                <p>
                    除非是為了向您提供您所要求的產品或服務、獲得您的授權，或有下列情形，否則GYM力
                    不會向任何非相關人士或非關係企業提供您的個人資料，或與之分享：
                </p>
                <ul>
                    <li>
                        我們向已簽署保密協議書之代表GYM力
                        執行業務或與我們共事的值得信賴的合作夥伴提供這些資料。這些公司可能會將您的個人資料用於協助
                        GYM 力
                        就我們和行銷夥伴所提供產品及服務的事宜，與您進行溝通。但這些公司無獨立權利分享這些資料。
                    </li>
                    <li>
                        我們對傳票、法院命令或法律程序作出回應、取得或行使法律權利，或對訴訟上之請求提出防禦。
                    </li>
                    <li>
                        我們認為為了調查和防止非法活動、涉嫌詐欺、對人身安全有潛在威脅的狀況、對 GYM 力
                        服務條款的違反，或為了對上述情形採取應對措施，或法律另有規定，而有必要分享您的個人資料時。
                    </li>
                    <li>
                        如果GYM力
                        全部或部分業務被其他公司收購或合併，我們會將您的個人資料移轉給該公司。如果發生這種情況，GYM
                        力 會在您的個人資料被移轉且將適用不同的隱私權政策前通知您。
                    </li>
                </ul>

                <h2>會員查詢、修改及刪除個人帳號資料服務</h2>
                <p>
                    您可隨時查詢、閱覽及修改個人GYM力帳號資料。
                    GYM力將會發送行銷訊息至您的電子郵件信箱，您若欲停止收到此類訊息，可按照所收訊息中的指示取消訂閱這些訊息。如果您要刪除您的
                    GYM力帳號，請來電 02-23932610 或來信gymli@gmail.com。
                </p>

                <h2>機密性和安全性</h2>
                <p>
                    GYM力
                    已採取符合法規要求的實體、電子和程序防護措施，以致力確保您的個人資料在我們的系統上安全無虞。除此之外，我們會將有權存取您個人資料之員工，僅限於我們合理相信是為了向您提供產品或服務或為了完成工作而需要取得這些資料的員工。
                </p>

                <h2>隱私權保護政策修訂</h2>
                <p>
                    GYM力可不時修訂本政策。當我們在個人資料的處理上有重大變更時，會將通知傳送到您在GYM力
                    帳號的電子郵件地址，或在我們的網站上張貼告示。
                </p>

                <h2>問題和建議</h2>
                <p>如果您對本隱私政策有任何疑問或意見，請通過以下方式與我們聯繫：</p>
                <p>電子郵件：gymli@gmail.com</p>
                <p>地址：桃園市中壢區復興路46號9樓</p>
                <p>請注意，本隱私政策與 Google 的服務條款和隱私政策共同適用。</p>
            </section>
        </main>
    </div>
</template>

<script>
export default {
    name: 'PrivacyPolicy'
}
</script>

<style scoped>
header {
    text-align: center;
    margin-bottom: 20px;
}

h1 {
    font-size: 24px;
    margin-top: 60px;
}

main {
    padding: 20px;
}

h2 {
    font-size: 20px;
    margin-top: 20px;
}

h3 {
    font-size: 18px;
    margin-top: 15px;
}

ul,
ol {
    margin: 10px 0;
    padding-left: 20px;
}

ul li,
ol li {
    margin-bottom: 5px;
}

footer {
    text-align: center;
    margin-top: 30px;
}

footer p {
    margin: 5px 0;
}
</style>
